; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	thermograph0 - mode
	image4 - mode
	thermograph3 - mode
	image1 - mode
	thermograph2 - mode
	Star0 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image4)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph3)
	(supports instrument2 image1)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
	(supports instrument3 image4)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 image1)
	(supports instrument4 image4)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument5 image4)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 image4)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(pointing satellite0 Planet8)
	(pointing satellite2 GroundStation3)
	(have_image Phenomenon5 thermograph3)
	(have_image Phenomenon6 image1)
	(have_image Planet7 image1)
	(have_image Planet8 thermograph2)
))

)

; plan
1. (turn_to satellite3 groundstation1 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 groundstation1)
   goals met: 0 of 6
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 6
3. (calibrate satellite3 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 0 of 6
4. (turn_to satellite3 planet8 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet8)
   goals met: 0 of 6
5. (turn_to satellite1 star4 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star4)
   goals met: 0 of 6
6. (turn_to satellite0 planet8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet8)
   goals met: 1 of 6
7. (take_image satellite3 planet8 instrument5 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 2 of 6
8. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 6
9. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 2 of 6
10. (turn_to satellite1 phenomenon5 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 6
11. (take_image satellite1 phenomenon5 instrument2 thermograph3)
   added: (have_image phenomenon5 thermograph3)
   goals met: 3 of 6
12. (turn_to satellite1 phenomenon6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon6)
   goals met: 3 of 6
13. (take_image satellite1 phenomenon6 instrument2 image1)
   added: (have_image phenomenon6 image1)
   goals met: 4 of 6
14. (turn_to satellite1 planet7 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet7)
   goals met: 4 of 6
15. (take_image satellite1 planet7 instrument2 image1)
   added: (have_image planet7 image1)
   goals met: 5 of 6
16. (turn_to satellite2 groundstation3 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 groundstation3)
   goals met: 6 of 6
